In [19]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [20]:
%sql mysql+pymysql://root:Betty%40mysql123%21@localhost:3306/md_water_services

## Clustering data to unveil Maji ndogo's water crisis

#### Cleaning data

# Now, the employee table as we are going to see it has no data.We are going to update this for sending emails to them.The emails formats are first_name.last.last_name@ndogowater.gov

In [21]:
#Lets show all tables

In [22]:
%%sql
SHOW TABLES;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
8 rows affected.

[('data_dictionary',),
 ('employee',),
 ('global_water_access',),
 ('location',),
 ('visits',),
 ('water_quality',),
 ('water_source',),
 ('well_pollution',)]

In [23]:
#The employee table

In [24]:
%%sql 
SELECT *
FROM employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[(0, 'Amara Jengo', '+99637993287 ', None, '36 Pwani Mchangani Road', 'Sokoto', 'Ilanga', 'Field Surveyor'),
 (1, 'Bello Azibo', '+99643864786 ', None, '129 Ziwa La Kioo Road', 'Kilimani', 'Rural', 'Field Surveyor'),
 (2, 'Bakari Iniko', '+99222599041 ', None, '18 Mlima Tazama Avenue', 'Hawassa', 'Rural', 'Field Surveyor'),
 (3, 'Malachi Mavuso', '+99945849900 ', None, '100 Mogadishu Road', 'Akatsi', 'Lusaka', 'Field Surveyor'),
 (4, 'Cheche Buhle', '+99381679640 ', None, '1 Savanna Street', 'Akatsi', 'Rural', 'Field Surveyor')]

In [25]:
#The email Column

In [26]:
%%sql
SELECT email
FROM employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[(None,), (None,), (None,), (None,), (None,)]

We can determine the email address for each employee by:
- selecting the employee_name column
- replacing the space with a full stop
- make it lowercase
- and stitch it all together

In [27]:
#To remove the space space between the first and last names and replace it with a fullstop .We use the REPLACE command as below

In [28]:
%%sql
SELECT REPLACE(employee_name, " ", ".")
FROM employee
LIMIT 6;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
6 rows affected.

[('Amara.Jengo',),
 ('Bello.Azibo',),
 ('Bakari.Iniko',),
 ('Malachi.Mavuso',),
 ('Cheche.Buhle',),
 ('Zuriel.Matembo',)]

In [29]:
#Making it a lowercase

In [30]:
%%sql
SELECT LOWER(REPLACE(employee_name, " ", "."))
FROM employee
LIMIT 6 ;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
6 rows affected.

[('amara.jengo',),
 ('bello.azibo',),
 ('bakari.iniko',),
 ('malachi.mavuso',),
 ('cheche.buhle',),
 ('zuriel.matembo',)]

In [31]:
# Using CONCAT to stitch the other part of the email

In [32]:
%%sql
SELECT CONCAT(LOWER(REPLACE(employee_name, " ", ".")), '@ndogowater.gov') AS new_email
FROM employee
LIMIT 6 ;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
6 rows affected.

[('amara.jengo@ndogowater.gov',),
 ('bello.azibo@ndogowater.gov',),
 ('bakari.iniko@ndogowater.gov',),
 ('malachi.mavuso@ndogowater.gov',),
 ('cheche.buhle@ndogowater.gov',),
 ('zuriel.matembo@ndogowater.gov',)]

In [33]:
#Now to update the email column with the email addresses

In [38]:
%%sql
UPDATE employee
SET email = CONCAT(LOWER(REPLACE(employee_name, " ", ".")), '@ndogowater.gov') ;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
56 rows affected.

[]

In [39]:
#Lets check the length of the phone numbers, it should be 12 but its giving us 13, because of the space at the end which should be removed

In [55]:
%%sql
SELECT LENGTH(phone_number)
FROM employee
LIMIT 7;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
7 rows affected.

[(13,), (13,), (13,), (13,), (13,), (13,), (13,)]

In [47]:
#We will use  TRIM() to write aa SELECT query again to remove space from a string and UPDATE the records just as before

In [56]:
%%sql
SELECT TRIM(phone_number) AS Trimmed_String
FROM employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('+99637993287',),
 ('+99643864786',),
 ('+99222599041',),
 ('+99945849900',),
 ('+99381679640',)]

In [58]:
%%sql
UPDATE employee
SET phone_number = TRIM(phone_number)

 * mysql+pymysql://root:***@localhost:3306/md_water_services
56 rows affected.

[]

In [60]:
#To check the length of the phone number

In [61]:
%%sql
SELECT LENGTH(phone_number)
FROM employee
LIMIT 7;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
7 rows affected.

[(12,), (12,), (12,), (12,), (12,), (12,), (12,)]

#### Honouring workers

#To see how employees lived, using the employee table to count how many of our employees live in each town

In [64]:
#Lets first determine how many distinct towns there are

In [65]:
%%sql
SELECT DISTINCT town_name
FROM employee;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
9 rows affected.

[('Ilanga',),
 ('Rural',),
 ('Lusaka',),
 ('Zanzibar',),
 ('Dahabu',),
 ('Kintampo',),
 ('Harare',),
 ('Yaounde',),
 ('Serowe',)]

In [ ]:
#lets now perform a count based on number of employee_name(s) on each town

In [71]:
%%sql
SELECT town_name, COUNT(*) AS employee_name
FROM employee
GROUP BY town_name
#ORDER BY employee_name DESC;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
9 rows affected.

[('Ilanga', 3),
 ('Rural', 29),
 ('Lusaka', 4),
 ('Zanzibar', 4),
 ('Dahabu', 6),
 ('Kintampo', 1),
 ('Harare', 5),
 ('Yaounde', 1),
 ('Serowe', 3)]

#We need to highlight  top 3 firld surveyors, that is , those who collected the most records
#So let's use the database to get the employee_ids and use those to get the names, email and phone numbers of the three field surveyors with the most location visits.
#Let's first look at the number of records each employee collected. we first find the correct table, use the COUNT() function and then group, order
and limit the results to only see the top 3 employee_ids with the highest number of locations visited.

In [81]:
%%sql
SELECT e.assigned_employee_id, COUNT(*) AS number_of_visits
FROM employee e
JOIN visits v ON e.assigned_employee_id = v.assigned_employee_id
GROUP BY e.assigned_employee_id
ORDER BY number_of_visits DESC
LIMIT 3;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
3 rows affected.

[(1, 3708), (30, 3676), (34, 3539)]